node {
  name: "parallel_read/filenames/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1024
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1024
          }
        }
        string_val: "../datasets/train-00187-of-01024"
        string_val: "../datasets/train-00186-of-01024"
        string_val: "../datasets/train-00549-of-01024"
        string_val: "../datasets/train-00548-of-01024"
        string_val: "../datasets/train-00843-of-01024"
        string_val: "../datasets/train-00842-of-01024"
        string_val: "../datasets/train-01021-of-01024"
        string_val: "../datasets/train-01020-of-01024"
        string_val: "../datasets/train-00441-of-01024"
        string_val: "../datasets/train-00627-of-01024"
        string_val: "../datasets/train-00626-of-01024"
        string_val: "../datasets/train-00440-of-01024"
        string_val: "../datasets/train-00373-of-01024"
        string_val: "../datasets/train-00115-of-01024"
        string_val: "../datasets/train-00114-of-01024"
        string_val: "../datasets/train-00372-of-01024"
        string_val: "../datasets/train-00054-of-01024"
        string_val: "../datasets/train-00232-of-01024"
        string_val: "../datasets/train-00233-of-01024"
        string_val: "../datasets/train-00055-of-01024"
        string_val: "../datasets/train-00766-of-01024"
        string_val: "../datasets/train-00990-of-01024"
        string_val: "../datasets/train-00500-of-01024"
        string_val: "../datasets/train-00991-of-01024"
        string_val: "../datasets/train-00501-of-01024"
        string_val: "../datasets/train-00767-of-01024"
        string_val: "../datasets/train-00592-of-01024"
        string_val: "../datasets/train-00902-of-01024"
        string_val: "../datasets/train-00593-of-01024"
        string_val: "../datasets/train-00903-of-01024"
        string_val: "../datasets/train-00408-of-01024"
        string_val: "../datasets/train-00898-of-01024"
        string_val: "../datasets/train-00409-of-01024"
        string_val: "../datasets/train-00899-of-01024"
        string_val: "../datasets/train-00245-of-01024"
        string_val: "../datasets/train-00023-of-01024"
        string_val: "../datasets/train-00022-of-01024"
        string_val: "../datasets/train-00244-of-01024"
        string_val: "../datasets/train-00577-of-01024"
        string_val: "../datasets/train-00711-of-01024"
        string_val: "../datasets/train-00710-of-01024"
        string_val: "../datasets/train-00576-of-01024"
        string_val: "../datasets/train-00975-of-01024"
        string_val: "../datasets/train-00783-of-01024"
        string_val: "../datasets/train-00782-of-01024"
        string_val: "../datasets/train-00974-of-01024"
        string_val: "../datasets/train-00619-of-01024"
        string_val: "../datasets/train-00618-of-01024"
        string_val: "../datasets/train-00396-of-01024"
        string_val: "../datasets/train-00397-of-01024"
        string_val: "../datasets/train-00758-of-01024"
        string_val: "../datasets/train-00759-of-01024"
        string_val: "../datasets/train-00834-of-01024"
        string_val: "../datasets/train-00835-of-01024"
        string_val: "../datasets/train-00650-of-01024"
        string_val: "../datasets/train-00436-of-01024"
        string_val: "../datasets/train-00437-of-01024"
        string_val: "../datasets/train-00651-of-01024"
        string_val: "../datasets/train-00162-of-01024"
        string_val: "../datasets/train-00304-of-01024"
        string_val: "../datasets/train-00305-of-01024"
        string_val: "../datasets/train-00163-of-01024"
        string_val: "../datasets/train-00664-of-01024"
        string_val: "../datasets/train-00892-of-01024"
        string_val: "../datasets/train-00402-of-01024"
        string_val: "../datasets/train-00893-of-01024"
        string_val: "../datasets/train-00403-of-01024"
        string_val: "../datasets/train-00665-of-01024"
        string_val: "../datasets/train-00908-of-01024"
        string_val: "../datasets/train-00598-of-01024"
        string_val: "../datasets/train-00909-of-01024"
        string_val: "../datasets/train-00599-of-01024"
        string_val: "../datasets/train-00156-of-01024"
        string_val: "../datasets/train-00330-of-01024"
        string_val: "../datasets/train-00331-of-01024"
        string_val: "../datasets/train-00157-of-01024"
        string_val: "../datasets/train-00490-of-01024"
        string_val: "../datasets/train-00800-of-01024"
        string_val: "../datasets/train-00491-of-01024"
        string_val: "../datasets/train-00801-of-01024"
        string_val: "../datasets/train-00238-of-01024"
        string_val: "../datasets/train-00239-of-01024"
        string_val: "../datasets/train-00379-of-01024"
        string_val: "../datasets/train-00378-of-01024"
        string_val: "../datasets/train-00941-of-01024"
        string_val: "../datasets/train-00940-of-01024"
        string_val: "../datasets/train-00085-of-01024"
        string_val: "../datasets/train-00084-of-01024"
        string_val: "../datasets/train-00271-of-01024"
        string_val: "../datasets/train-00017-of-01024"
        string_val: "../datasets/train-00016-of-01024"
        string_val: "../datasets/train-00270-of-01024"
        string_val: "../datasets/train-00849-of-01024"
        string_val: "../datasets/train-00848-of-01024"
        string_val: "../datasets/train-00543-of-01024"
        string_val: "../datasets/train-00725-of-01024"
        string_val: "../datasets/train-00724-of-01024"
        string_val: "../datasets/train-00542-of-01024"
        string_val: "../datasets/train-00168-of-01024"
        string_val: "../datasets/train-00169-of-01024"
        string_val: "../datasets/train-00936-of-01024"
        string_val: "../datasets/train-00937-of-01024"
        string_val: "../datasets/train-00294-of-01024"
        string_val: "../datasets/train-00295-of-01024"
        string_val: "../datasets/train-00060-of-01024"
        string_val: "../datasets/train-00206-of-01024"
        string_val: "../datasets/train-00207-of-01024"
        string_val: "../datasets/train-00061-of-01024"
        string_val: "../datasets/train-00752-of-01024"
        string_val: "../datasets/train-00534-of-01024"
        string_val: "../datasets/train-00535-of-01024"
        string_val: "../datasets/train-00753-of-01024"
        string_val: "../datasets/train-00475-of-01024"
        string_val: "../datasets/train-00613-of-01024"
        string_val: "../datasets/train-00612-of-01024"
        string_val: "../datasets/train-00474-of-01024"
        string_val: "../datasets/train-01015-of-01024"
        string_val: "../datasets/train-01014-of-01024"
        string_val: "../datasets/train-00789-of-01024"
        string_val: "../datasets/train-00788-of-01024"
        string_val: "../datasets/train-00347-of-01024"
        string_val: "../datasets/train-00121-of-01024"
        string_val: "../datasets/train-00120-of-01024"
        string_val: "../datasets/train-00346-of-01024"
        string_val: "../datasets/train-00877-of-01024"
        string_val: "../datasets/train-00681-of-01024"
        string_val: "../datasets/train-00680-of-01024"
        string_val: "../datasets/train-00876-of-01024"
        string_val: "../datasets/train-00029-of-01024"
        string_val: "../datasets/train-00028-of-01024"
        string_val: "../datasets/train-00915-of-01024"
        string_val: "../datasets/train-00585-of-01024"
        string_val: "../datasets/train-00914-of-01024"
        string_val: "../datasets/train-00584-of-01024"
        string_val: "../datasets/train-00679-of-01024"
        string_val: "../datasets/train-00678-of-01024"
        string_val: "../datasets/train-00043-of-01024"
        string_val: "../datasets/train-00225-of-01024"
        string_val: "../datasets/train-00224-of-01024"
        string_val: "../datasets/train-00042-of-01024"
        string_val: "../datasets/train-00771-of-01024"
        string_val: "../datasets/train-00517-of-01024"
        string_val: "../datasets/train-00987-of-01024"
        string_val: "../datasets/train-00516-of-01024"
        string_val: "../datasets/train-00986-of-01024"
        string_val: "../datasets/train-00770-of-01024"
        string_val: "../datasets/train-00456-of-01024"
        string_val: "../datasets/train-00630-of-01024"
        string_val: "../datasets/train-00631-of-01024"
        string_val: "../datasets/train-00457-of-01024"
        string_val: "../datasets/train-00098-of-01024"
        string_val: "../datasets/train-00099-of-01024"
        string_val: "../datasets/train-00364-of-01024"
        string_val: "../datasets/train-00102-of-01024"
        string_val: "../datasets/train-00103-of-01024"
        string_val: "../datasets/train-00365-of-01024"
        string_val: "../datasets/train-00738-of-01024"
        string_val: "../datasets/train-00739-of-01024"
        string_val: "../datasets/train-00190-of-01024"
        string_val: "../datasets/train-00191-of-01024"
        string_val: "../datasets/train-00854-of-01024"
        string_val: "../datasets/train-00855-of-01024"
        string_val: "../datasets/train-00647-of-01024"
        string_val: "../datasets/train-00421-of-01024"
        string_val: "../datasets/train-00420-of-01024"
        string_val: "../datasets/train-00646-of-01024"
        string_val: "../datasets/train-00289-of-01024"
        string_val: "../datasets/train-00288-of-01024"
        string_val: "../datasets/train-00175-of-01024"
        string_val: "../datasets/train-00313-of-01024"
        string_val: "../datasets/train-00312-of-01024"
        string_val: "../datasets/train-00174-of-01024"
        string_val: "../datasets/train-00529-of-01024"
        string_val: "../datasets/train-00528-of-01024"
        string_val: "../datasets/train-00381-of-01024"
        string_val: "../datasets/train-00380-of-01024"
        string_val: "../datasets/train-00823-of-01024"
        string_val: "../datasets/train-00822-of-01024"
        string_val: "../datasets/train-00962-of-01024"
        string_val: "../datasets/train-00794-of-01024"
        string_val: "../datasets/train-00795-of-01024"
        string_val: "../datasets/train-00963-of-01024"
        string_val: "../datasets/train-01008-of-01024"
        string_val: "../datasets/train-01009-of-01024"
        string_val: "../datasets/train-00468-of-01024"
        string_val: "../datasets/train-00469-of-01024"
        string_val: "../datasets/train-00252-of-01024"
        string_val: "../datasets/train-00034-of-01024"
        string_val: "../datasets/train-00035-of-01024"
        string_val: "../datasets/train-00253-of-01024"
        string_val: "../datasets/train-00560-of-01024"
        string_val: "../datasets/train-00706-of-01024"
        string_val: "../datasets/train-00707-of-01024"
        string_val: "../datasets/train-00561-of-01024"
        string_val: "../datasets/train-00266-of-01024"
        string_val: "../datasets/train-00000-of-01024"
        string_val: "../datasets/train-00001-of-01024"
        string_val: "../datasets/train-00267-of-01024"
        string_val: "../datasets/train-00554-of-01024"
        string_val: "../datasets/train-00732-of-01024"
        string_val: "../datasets/train-00733-of-01024"
        string_val: "../datasets/train-00555-of-01024"
        string_val: "../datasets/train-00956-of-01024"
        string_val: "../datasets/train-00957-of-01024"
        string_val: "../datasets/train-00108-of-01024"
        string_val: "../datasets/train-00109-of-01024"
        string_val: "../datasets/train-00092-of-01024"
        string_val: "../datasets/train-00093-of-01024"
        string_val: "../datasets/train-00049-of-01024"
        string_val: "../datasets/train-00048-of-01024"
        string_val: "../datasets/train-00817-of-01024"
        string_val: "../datasets/train-00487-of-01024"
        string_val: "../datasets/train-00816-of-01024"
        string_val: "../datasets/train-00486-of-01024"
        string_val: "../datasets/train-00673-of-01024"
        string_val: "../datasets/train-00415-of-01024"
        string_val: "../datasets/train-00885-of-01024"
        string_val: "../datasets/train-00414-of-01024"
        string_val: "../datasets/train-00884-of-01024"
        string_val: "../datasets/train-00672-of-01024"
        string_val: "../datasets/train-00141-of-01024"
        string_val: "../datasets/train-00327-of-01024"
        string_val: "../datasets/train-00326-of-01024"
        string_val: "../datasets/train-00140-of-01024"
        string_val: "../datasets/train-00258-of-01024"
        string_val: "../datasets/train-00259-of-01024"
        string_val: "../datasets/train-00860-of-01024"
        string_val: "../datasets/train-00696-of-01024"
        string_val: "../datasets/train-00697-of-01024"
        string_val: "../datasets/train-00861-of-01024"
        string_val: "../datasets/train-01002-of-01024"
        string_val: "../datasets/train-01003-of-01024"
        string_val: "../datasets/train-00462-of-01024"
        string_val: "../datasets/train-00604-of-01024"
        string_val: "../datasets/train-00605-of-01024"
        string_val: "../datasets/train-00463-of-01024"
        string_val: "../datasets/train-00350-of-01024"
        string_val: "../datasets/train-00136-of-01024"
        string_val: "../datasets/train-00137-of-01024"
        string_val: "../datasets/train-00351-of-01024"
        string_val: "../datasets/train-00968-of-01024"
        string_val: "../datasets/train-00969-of-01024"
        string_val: "../datasets/train-00829-of-01024"
        string_val: "../datasets/train-00828-of-01024"
        string_val: "../datasets/train-00077-of-01024"
        string_val: "../datasets/train-00211-of-01024"
        string_val: "../datasets/train-00210-of-01024"
        string_val: "../datasets/train-00076-of-01024"
        string_val: "../datasets/train-00745-of-01024"
        string_val: "../datasets/train-00523-of-01024"
        string_val: "../datasets/train-00522-of-01024"
        string_val: "../datasets/train-00744-of-01024"
        string_val: "../datasets/train-00921-of-01024"
        string_val: "../datasets/train-00920-of-01024"
        string_val: "../datasets/train-00319-of-01024"
        string_val: "../datasets/train-00318-of-01024"
        string_val: "../datasets/train-00283-of-01024"
        string_val: "../datasets/train-00282-of-01024"
        string_val: "../datasets/train-00222-of-01024"
        string_val: "../datasets/train-00044-of-01024"
        string_val: "../datasets/train-00045-of-01024"
        string_val: "../datasets/train-00223-of-01024"
        string_val: "../datasets/train-00980-of-01024"
        string_val: "../datasets/train-00510-of-01024"
        string_val: "../datasets/train-00776-of-01024"
        string_val: "../datasets/train-00777-of-01024"
        string_val: "../datasets/train-00981-of-01024"
        string_val: "../datasets/train-00511-of-01024"
        string_val: "../datasets/train-00582-of-01024"
        string_val: "../datasets/train-00912-of-01024"
        string_val: "../datasets/train-00583-of-01024"
        string_val: "../datasets/train-00913-of-01024"
        string_val: "../datasets/train-00418-of-01024"
        string_val: "../datasets/train-00888-of-01024"
        string_val: "../datasets/train-00419-of-01024"
        string_val: "../datasets/train-00889-of-01024"
        string_val: "../datasets/train-00559-of-01024"
        string_val: "../datasets/train-00558-of-01024"
        string_val: "../datasets/train-00197-of-01024"
        string_val: "../datasets/train-00196-of-01024"
        string_val: "../datasets/train-00853-of-01024"
        string_val: "../datasets/train-00852-of-01024"
        string_val: "../datasets/train-00637-of-01024"
        string_val: "../datasets/train-00451-of-01024"
        string_val: "../datasets/train-00450-of-01024"
        string_val: "../datasets/train-00636-of-01024"
        string_val: "../datasets/train-00105-of-01024"
        string_val: "../datasets/train-00363-of-01024"
        string_val: "../datasets/train-00362-of-01024"
        string_val: "../datasets/train-00104-of-01024"
        string_val: "../datasets/train-00748-of-01024"
        string_val: "../datasets/train-00749-of-01024"
        string_val: "../datasets/train-00386-of-01024"
        string_val: "../datasets/train-00387-of-01024"
        string_val: "../datasets/train-00824-of-01024"
        string_val: "../datasets/train-00825-of-01024"
        string_val: "../datasets/train-00426-of-01024"
        string_val: "../datasets/train-00640-of-01024"
        string_val: "../datasets/train-00641-of-01024"
        string_val: "../datasets/train-00427-of-01024"
        string_val: "../datasets/train-00314-of-01024"
        string_val: "../datasets/train-00172-of-01024"
        string_val: "../datasets/train-00173-of-01024"
        string_val: "../datasets/train-00315-of-01024"
        string_val: "../datasets/train-00033-of-01024"
        string_val: "../datasets/train-00255-of-01024"
        string_val: "../datasets/train-00254-of-01024"
        string_val: "../datasets/train-00032-of-01024"
        string_val: "../datasets/train-00701-of-01024"
        string_val: "../datasets/train-00567-of-01024"
        string_val: "../datasets/train-00566-of-01024"
        string_val: "../datasets/train-00700-of-01024"
        string_val: "../datasets/train-00793-of-01024"
        string_val: "../datasets/train-00965-of-01024"
        string_val: "../datasets/train-00964-of-01024"
        string_val: "../datasets/train-00792-of-01024"
        string_val: "../datasets/train-00609-of-01024"
        string_val: "../datasets/train-00608-of-01024"
        string_val: "../datasets/train-00951-of-01024"
        string_val: "../datasets/train-00950-of-01024"
        string_val: "../datasets/train-00369-of-01024"
        string_val: "../datasets/train-00368-of-01024"
        string_val: "../datasets/train-00095-of-01024"
        string_val: "../datasets/train-00094-of-01024"
        string_val: "../datasets/train-00859-of-01024"
        string_val: "../datasets/train-00858-of-01024"
        string_val: "../datasets/train-00007-of-01024"
        string_val: "../datasets/train-00261-of-01024"
        string_val: "../datasets/train-00260-of-01024"
        string_val: "../datasets/train-00006-of-01024"
        string_val: "../datasets/train-00735-of-01024"
        string_val: "../datasets/train-00553-of-01024"
        string_val: "../datasets/train-00552-of-01024"
        string_val: "../datasets/train-00734-of-01024"
        string_val: "../datasets/train-00882-of-01024"
        string_val: "../datasets/train-00412-of-01024"
        string_val: "../datasets/train-00674-of-01024"
        string_val: "../datasets/train-00675-of-01024"
        string_val: "../datasets/train-00883-of-01024"
        string_val: "../datasets/train-00413-of-01024"
        string_val: "../datasets/train-00320-of-01024"
        string_val: "../datasets/train-00146-of-01024"
        string_val: "../datasets/train-00147-of-01024"
        string_val: "../datasets/train-00321-of-01024"
        string_val: "../datasets/train-00918-of-01024"
        string_val: "../datasets/train-00588-of-01024"
        string_val: "../datasets/train-00919-of-01024"
        string_val: "../datasets/train-00589-of-01024"
        string_val: "../datasets/train-00228-of-01024"
        string_val: "../datasets/train-00229-of-01024"
        string_val: "../datasets/train-00480-of-01024"
        string_val: "../datasets/train-00810-of-01024"
        string_val: "../datasets/train-00481-of-01024"
        string_val: "../datasets/train-00811-of-01024"
        string_val: "../datasets/train-01005-of-01024"
        string_val: "../datasets/train-01004-of-01024"
        string_val: "../datasets/train-00603-of-01024"
        string_val: "../datasets/train-00465-of-01024"
        string_val: "../datasets/train-00464-of-01024"
        string_val: "../datasets/train-00602-of-01024"
        string_val: "../datasets/train-00131-of-01024"
        string_val: "../datasets/train-00357-of-01024"
        string_val: "../datasets/train-00356-of-01024"
        string_val: "../datasets/train-00130-of-01024"
        string_val: "../datasets/train-00799-of-01024"
        string_val: "../datasets/train-00798-of-01024"
        string_val: "../datasets/train-00039-of-01024"
        string_val: "../datasets/train-00038-of-01024"
        string_val: "../datasets/train-00691-of-01024"
        string_val: "../datasets/train-00867-of-01024"
        string_val: "../datasets/train-00866-of-01024"
        string_val: "../datasets/train-00690-of-01024"
        string_val: "../datasets/train-00926-of-01024"
        string_val: "../datasets/train-00927-of-01024"
        string_val: "../datasets/train-00178-of-01024"
        string_val: "../datasets/train-00179-of-01024"
        string_val: "../datasets/train-00284-of-01024"
        string_val: "../datasets/train-00285-of-01024"
        string_val: "../datasets/train-00216-of-01024"
        string_val: "../datasets/train-00070-of-01024"
        string_val: "../datasets/train-00071-of-01024"
        string_val: "../datasets/train-00217-of-01024"
        string_val: "../datasets/train-00524-of-01024"
        string_val: "../datasets/train-00742-of-01024"
        string_val: "../datasets/train-00743-of-01024"
        string_val: "../datasets/train-00525-of-01024"
        string_val: "../datasets/train-00088-of-01024"
        string_val: "../datasets/train-00089-of-01024"
        string_val: "../datasets/train-00620-of-01024"
        string_val: "../datasets/train-00446-of-01024"
        string_val: "../datasets/train-00447-of-01024"
        string_val: "../datasets/train-00621-of-01024"
        string_val: "../datasets/train-00112-of-01024"
        string_val: "../datasets/train-00374-of-01024"
        string_val: "../datasets/train-00375-of-01024"
        string_val: "../datasets/train-00113-of-01024"
        string_val: "../datasets/train-00180-of-01024"
        string_val: "../datasets/train-00181-of-01024"
        string_val: "../datasets/train-00728-of-01024"
        string_val: "../datasets/train-00729-of-01024"
        string_val: "../datasets/train-00844-of-01024"
        string_val: "../datasets/train-00845-of-01024"
        string_val: "../datasets/train-00905-of-01024"
        string_val: "../datasets/train-00595-of-01024"
        string_val: "../datasets/train-00904-of-01024"
        string_val: "../datasets/train-00594-of-01024"
        string_val: "../datasets/train-00669-of-01024"
        string_val: "../datasets/train-00668-of-01024"
        string_val: "../datasets/train-00235-of-01024"
        string_val: "../datasets/train-00053-of-01024"
        string_val: "../datasets/train-00052-of-01024"
        string_val: "../datasets/train-00234-of-01024"
        string_val: "../datasets/train-00507-of-01024"
        string_val: "../datasets/train-00997-of-01024"
        string_val: "../datasets/train-00761-of-01024"
        string_val: "../datasets/train-00760-of-01024"
        string_val: "../datasets/train-00506-of-01024"
        string_val: "../datasets/train-00996-of-01024"
        string_val: "../datasets/train-00784-of-01024"
        string_val: "../datasets/train-00972-of-01024"
        string_val: "../datasets/train-00973-of-01024"
        string_val: "../datasets/train-00785-of-01024"
        string_val: "../datasets/train-00478-of-01024"
        string_val: "../datasets/train-00479-of-01024"
        string_val: "../datasets/train-01018-of-01024"
        string_val: "../datasets/train-01019-of-01024"
        string_val: "../datasets/train-00024-of-01024"
        string_val: "../datasets/train-00242-of-01024"
        string_val: "../datasets/train-00243-of-01024"
        string_val: "../datasets/train-00025-of-01024"
        string_val: "../datasets/train-00716-of-01024"
        string_val: "../datasets/train-00570-of-01024"
        string_val: "../datasets/train-00571-of-01024"
        string_val: "../datasets/train-00717-of-01024"
        string_val: "../datasets/train-00299-of-01024"
        string_val: "../datasets/train-00298-of-01024"
        string_val: "../datasets/train-00431-of-01024"
        string_val: "../datasets/train-00657-of-01024"
        string_val: "../datasets/train-00656-of-01024"
        string_val: "../datasets/train-00430-of-01024"
        string_val: "../datasets/train-00303-of-01024"
        string_val: "../datasets/train-00165-of-01024"
        string_val: "../datasets/train-00164-of-01024"
        string_val: "../datasets/train-00302-of-01024"
        string_val: "../datasets/train-00391-of-01024"
        string_val: "../datasets/train-00390-of-01024"
        string_val: "../datasets/train-00539-of-01024"
        string_val: "../datasets/train-00538-of-01024"
        string_val: "../datasets/train-00833-of-01024"
        string_val: "../datasets/train-00832-of-01024"
        string_val: "../datasets/train-00807-of-01024"
        string_val: "../datasets/train-00497-of-01024"
        string_val: "../datasets/train-00806-of-01024"
        string_val: "../datasets/train-00496-of-01024"
        string_val: "../datasets/train-00059-of-01024"
        string_val: "../datasets/train-00058-of-01024"
        string_val: "../datasets/train-00405-of-01024"
        string_val: "../datasets/train-00895-of-01024"
        string_val: "../datasets/train-00663-of-01024"
        string_val: "../datasets/train-00662-of-01024"
        string_val: "../datasets/train-00404-of-01024"
        string_val: "../datasets/train-00894-of-01024"
        string_val: "../datasets/train-00337-of-01024"
        string_val: "../datasets/train-00151-of-01024"
        string_val: "../datasets/train-00150-of-01024"
        string_val: "../datasets/train-00336-of-01024"
        string_val: "../datasets/train-00010-of-01024"
        string_val: "../datasets/train-00276-of-01024"
        string_val: "../datasets/train-00277-of-01024"
        string_val: "../datasets/train-00011-of-01024"
        string_val: "../datasets/train-00722-of-01024"
        string_val: "../datasets/train-00544-of-01024"
        string_val: "../datasets/train-00545-of-01024"
        string_val: "../datasets/train-00723-of-01024"
        string_val: "../datasets/train-00118-of-01024"
        string_val: "../datasets/train-00119-of-01024"
        string_val: "../datasets/train-00946-of-01024"
        string_val: "../datasets/train-00947-of-01024"
        string_val: "../datasets/train-00082-of-01024"
        string_val: "../datasets/train-00083-of-01024"
        string_val: "../datasets/train-00201-of-01024"
        string_val: "../datasets/train-00067-of-01024"
        string_val: "../datasets/train-00066-of-01024"
        string_val: "../datasets/train-00200-of-01024"
        string_val: "../datasets/train-00839-of-01024"
        string_val: "../datasets/train-00838-of-01024"
        string_val: "../datasets/train-00533-of-01024"
        string_val: "../datasets/train-00755-of-01024"
        string_val: "../datasets/train-00754-of-01024"
        string_val: "../datasets/train-00532-of-01024"
        string_val: "../datasets/train-00309-of-01024"
        string_val: "../datasets/train-00308-of-01024"
        string_val: "../datasets/train-00931-of-01024"
        string_val: "../datasets/train-00930-of-01024"
        string_val: "../datasets/train-00293-of-01024"
        string_val: "../datasets/train-00292-of-01024"
        string_val: "../datasets/train-00686-of-01024"
        string_val: "../datasets/train-00870-of-01024"
        string_val: "../datasets/train-00871-of-01024"
        string_val: "../datasets/train-00687-of-01024"
        string_val: "../datasets/train-00248-of-01024"
        string_val: "../datasets/train-00249-of-01024"
        string_val: "../datasets/train-00614-of-01024"
        string_val: "../datasets/train-00472-of-01024"
        string_val: "../datasets/train-00473-of-01024"
        string_val: "../datasets/train-00615-of-01024"
        string_val: "../datasets/train-01012-of-01024"
        string_val: "../datasets/train-01013-of-01024"
        string_val: "../datasets/train-00978-of-01024"
        string_val: "../datasets/train-00979-of-01024"
        string_val: "../datasets/train-00126-of-01024"
        string_val: "../datasets/train-00340-of-01024"
        string_val: "../datasets/train-00341-of-01024"
        string_val: "../datasets/train-00127-of-01024"
        string_val: "../datasets/train-00557-of-01024"
        string_val: "../datasets/train-00731-of-01024"
        string_val: "../datasets/train-00730-of-01024"
        string_val: "../datasets/train-00556-of-01024"
        string_val: "../datasets/train-00199-of-01024"
        string_val: "../datasets/train-00198-of-01024"
        string_val: "../datasets/train-00265-of-01024"
        string_val: "../datasets/train-00003-of-01024"
        string_val: "../datasets/train-00002-of-01024"
        string_val: "../datasets/train-00264-of-01024"
        string_val: "../datasets/train-00639-of-01024"
        string_val: "../datasets/train-00638-of-01024"
        string_val: "../datasets/train-00091-of-01024"
        string_val: "../datasets/train-00090-of-01024"
        string_val: "../datasets/train-00955-of-01024"
        string_val: "../datasets/train-00954-of-01024"
        string_val: "../datasets/train-00814-of-01024"
        string_val: "../datasets/train-00484-of-01024"
        string_val: "../datasets/train-00815-of-01024"
        string_val: "../datasets/train-00485-of-01024"
        string_val: "../datasets/train-00778-of-01024"
        string_val: "../datasets/train-00779-of-01024"
        string_val: "../datasets/train-00142-of-01024"
        string_val: "../datasets/train-00324-of-01024"
        string_val: "../datasets/train-00325-of-01024"
        string_val: "../datasets/train-00143-of-01024"
        string_val: "../datasets/train-00670-of-01024"
        string_val: "../datasets/train-00416-of-01024"
        string_val: "../datasets/train-00886-of-01024"
        string_val: "../datasets/train-00417-of-01024"
        string_val: "../datasets/train-00887-of-01024"
        string_val: "../datasets/train-00671-of-01024"
        string_val: "../datasets/train-00863-of-01024"
        string_val: "../datasets/train-00695-of-01024"
        string_val: "../datasets/train-00694-of-01024"
        string_val: "../datasets/train-00862-of-01024"
        string_val: "../datasets/train-00569-of-01024"
        string_val: "../datasets/train-00568-of-01024"
        string_val: "../datasets/train-00353-of-01024"
        string_val: "../datasets/train-00135-of-01024"
        string_val: "../datasets/train-00134-of-01024"
        string_val: "../datasets/train-00352-of-01024"
        string_val: "../datasets/train-01001-of-01024"
        string_val: "../datasets/train-01000-of-01024"
        string_val: "../datasets/train-00461-of-01024"
        string_val: "../datasets/train-00607-of-01024"
        string_val: "../datasets/train-00606-of-01024"
        string_val: "../datasets/train-00460-of-01024"
        string_val: "../datasets/train-00746-of-01024"
        string_val: "../datasets/train-00520-of-01024"
        string_val: "../datasets/train-00521-of-01024"
        string_val: "../datasets/train-00747-of-01024"
        string_val: "../datasets/train-00388-of-01024"
        string_val: "../datasets/train-00389-of-01024"
        string_val: "../datasets/train-00074-of-01024"
        string_val: "../datasets/train-00212-of-01024"
        string_val: "../datasets/train-00213-of-01024"
        string_val: "../datasets/train-00075-of-01024"
        string_val: "../datasets/train-00428-of-01024"
        string_val: "../datasets/train-00429-of-01024"
        string_val: "../datasets/train-00280-of-01024"
        string_val: "../datasets/train-00281-of-01024"
        string_val: "../datasets/train-00922-of-01024"
        string_val: "../datasets/train-00923-of-01024"
        string_val: "../datasets/train-00148-of-01024"
        string_val: "../datasets/train-00149-of-01024"
        string_val: "../datasets/train-00916-of-01024"
        string_val: "../datasets/train-00586-of-01024"
        string_val: "../datasets/train-00917-of-01024"
        string_val: "../datasets/train-00587-of-01024"
        string_val: "../datasets/train-00772-of-01024"
        string_val: "../datasets/train-00514-of-01024"
        string_val: "../datasets/train-00984-of-01024"
        string_val: "../datasets/train-00515-of-01024"
        string_val: "../datasets/train-00985-of-01024"
        string_val: "../datasets/train-00773-of-01024"
        string_val: "../datasets/train-00040-of-01024"
        string_val: "../datasets/train-00226-of-01024"
        string_val: "../datasets/train-00227-of-01024"
        string_val: "../datasets/train-00041-of-01024"
        string_val: "../datasets/train-00367-of-01024"
        string_val: "../datasets/train-00101-of-01024"
        string_val: "../datasets/train-00100-of-01024"
        string_val: "../datasets/train-00366-of-01024"
        string_val: "../datasets/train-00455-of-01024"
        string_val: "../datasets/train-00633-of-01024"
        string_val: "../datasets/train-00632-of-01024"
        string_val: "../datasets/train-00454-of-01024"
        string_val: "../datasets/train-00857-of-01024"
        string_val: "../datasets/train-00856-of-01024"
        string_val: "../datasets/train-00009-of-01024"
        string_val: "../datasets/train-00008-of-01024"
        string_val: "../datasets/train-00193-of-01024"
        string_val: "../datasets/train-00192-of-01024"
        string_val: "../datasets/train-00928-of-01024"
        string_val: "../datasets/train-00929-of-01024"
        string_val: "../datasets/train-00176-of-01024"
        string_val: "../datasets/train-00310-of-01024"
        string_val: "../datasets/train-00311-of-01024"
        string_val: "../datasets/train-00177-of-01024"
        string_val: "../datasets/train-00644-of-01024"
        string_val: "../datasets/train-00422-of-01024"
        string_val: "../datasets/train-00423-of-01024"
        string_val: "../datasets/train-00645-of-01024"
        string_val: "../datasets/train-00820-of-01024"
        string_val: "../datasets/train-00821-of-01024"
        string_val: "../datasets/train-00218-of-01024"
        string_val: "../datasets/train-00219-of-01024"
        string_val: "../datasets/train-00382-of-01024"
        string_val: "../datasets/train-00383-of-01024"
        string_val: "../datasets/train-00359-of-01024"
        string_val: "../datasets/train-00358-of-01024"
        string_val: "../datasets/train-00961-of-01024"
        string_val: "../datasets/train-00797-of-01024"
        string_val: "../datasets/train-00796-of-01024"
        string_val: "../datasets/train-00960-of-01024"
        string_val: "../datasets/train-00563-of-01024"
        string_val: "../datasets/train-00705-of-01024"
        string_val: "../datasets/train-00704-of-01024"
        string_val: "../datasets/train-00562-of-01024"
        string_val: "../datasets/train-00251-of-01024"
        string_val: "../datasets/train-00037-of-01024"
        string_val: "../datasets/train-00036-of-01024"
        string_val: "../datasets/train-00250-of-01024"
        string_val: "../datasets/train-00869-of-01024"
        string_val: "../datasets/train-00868-of-01024"
        string_val: "../datasets/train-00155-of-01024"
        string_val: "../datasets/train-00333-of-01024"
        string_val: "../datasets/train-00332-of-01024"
        string_val: "../datasets/train-00154-of-01024"
        string_val: "../datasets/train-00667-of-01024"
        string_val: "../datasets/train-00891-of-01024"
        string_val: "../datasets/train-00401-of-01024"
        string_val: "../datasets/train-00890-of-01024"
        string_val: "../datasets/train-00400-of-01024"
        string_val: "../datasets/train-00666-of-01024"
        string_val: "../datasets/train-00493-of-01024"
        string_val: "../datasets/train-00803-of-01024"
        string_val: "../datasets/train-00492-of-01024"
        string_val: "../datasets/train-00802-of-01024"
        string_val: "../datasets/train-00509-of-01024"
        string_val: "../datasets/train-00999-of-01024"
        string_val: "../datasets/train-00508-of-01024"
        string_val: "../datasets/train-00998-of-01024"
        string_val: "../datasets/train-00086-of-01024"
        string_val: "../datasets/train-00087-of-01024"
        string_val: "../datasets/train-00448-of-01024"
        string_val: "../datasets/train-00449-of-01024"
        string_val: "../datasets/train-00942-of-01024"
        string_val: "../datasets/train-00943-of-01024"
        string_val: "../datasets/train-00540-of-01024"
        string_val: "../datasets/train-00726-of-01024"
        string_val: "../datasets/train-00727-of-01024"
        string_val: "../datasets/train-00541-of-01024"
        string_val: "../datasets/train-00272-of-01024"
        string_val: "../datasets/train-00014-of-01024"
        string_val: "../datasets/train-00015-of-01024"
        string_val: "../datasets/train-00273-of-01024"
        string_val: "../datasets/train-00297-of-01024"
        string_val: "../datasets/train-00296-of-01024"
        string_val: "../datasets/train-00659-of-01024"
        string_val: "../datasets/train-00658-of-01024"
        string_val: "../datasets/train-00935-of-01024"
        string_val: "../datasets/train-00934-of-01024"
        string_val: "../datasets/train-00751-of-01024"
        string_val: "../datasets/train-00537-of-01024"
        string_val: "../datasets/train-00536-of-01024"
        string_val: "../datasets/train-00750-of-01024"
        string_val: "../datasets/train-00063-of-01024"
        string_val: "../datasets/train-00205-of-01024"
        string_val: "../datasets/train-00204-of-01024"
        string_val: "../datasets/train-00062-of-01024"
        string_val: "../datasets/train-00344-of-01024"
        string_val: "../datasets/train-00122-of-01024"
        string_val: "../datasets/train-00123-of-01024"
        string_val: "../datasets/train-00345-of-01024"
        string_val: "../datasets/train-00476-of-01024"
        string_val: "../datasets/train-00610-of-01024"
        string_val: "../datasets/train-00611-of-01024"
        string_val: "../datasets/train-00477-of-01024"
        string_val: "../datasets/train-01016-of-01024"
        string_val: "../datasets/train-01017-of-01024"
        string_val: "../datasets/train-00874-of-01024"
        string_val: "../datasets/train-00682-of-01024"
        string_val: "../datasets/train-00683-of-01024"
        string_val: "../datasets/train-00875-of-01024"
        string_val: "../datasets/train-00718-of-01024"
        string_val: "../datasets/train-00719-of-01024"
        string_val: "../datasets/train-00278-of-01024"
        string_val: "../datasets/train-00279-of-01024"
        string_val: "../datasets/train-00840-of-01024"
        string_val: "../datasets/train-00841-of-01024"
        string_val: "../datasets/train-00184-of-01024"
        string_val: "../datasets/train-00185-of-01024"
        string_val: "../datasets/train-00370-of-01024"
        string_val: "../datasets/train-00116-of-01024"
        string_val: "../datasets/train-00117-of-01024"
        string_val: "../datasets/train-00371-of-01024"
        string_val: "../datasets/train-00948-of-01024"
        string_val: "../datasets/train-00949-of-01024"
        string_val: "../datasets/train-01022-of-01024"
        string_val: "../datasets/train-01023-of-01024"
        string_val: "../datasets/train-00442-of-01024"
        string_val: "../datasets/train-00624-of-01024"
        string_val: "../datasets/train-00625-of-01024"
        string_val: "../datasets/train-00443-of-01024"
        string_val: "../datasets/train-00765-of-01024"
        string_val: "../datasets/train-00993-of-01024"
        string_val: "../datasets/train-00503-of-01024"
        string_val: "../datasets/train-00992-of-01024"
        string_val: "../datasets/train-00502-of-01024"
        string_val: "../datasets/train-00764-of-01024"
        string_val: "../datasets/train-00809-of-01024"
        string_val: "../datasets/train-00499-of-01024"
        string_val: "../datasets/train-00808-of-01024"
        string_val: "../datasets/train-00498-of-01024"
        string_val: "../datasets/train-00057-of-01024"
        string_val: "../datasets/train-00231-of-01024"
        string_val: "../datasets/train-00230-of-01024"
        string_val: "../datasets/train-00056-of-01024"
        string_val: "../datasets/train-00591-of-01024"
        string_val: "../datasets/train-00901-of-01024"
        string_val: "../datasets/train-00590-of-01024"
        string_val: "../datasets/train-00900-of-01024"
        string_val: "../datasets/train-00339-of-01024"
        string_val: "../datasets/train-00338-of-01024"
        string_val: "../datasets/train-00574-of-01024"
        string_val: "../datasets/train-00712-of-01024"
        string_val: "../datasets/train-00713-of-01024"
        string_val: "../datasets/train-00575-of-01024"
        string_val: "../datasets/train-00688-of-01024"
        string_val: "../datasets/train-00689-of-01024"
        string_val: "../datasets/train-00246-of-01024"
        string_val: "../datasets/train-00020-of-01024"
        string_val: "../datasets/train-00021-of-01024"
        string_val: "../datasets/train-00247-of-01024"
        string_val: "../datasets/train-00976-of-01024"
        string_val: "../datasets/train-00780-of-01024"
        string_val: "../datasets/train-00781-of-01024"
        string_val: "../datasets/train-00977-of-01024"
        string_val: "../datasets/train-00128-of-01024"
        string_val: "../datasets/train-00129-of-01024"
        string_val: "../datasets/train-00069-of-01024"
        string_val: "../datasets/train-00068-of-01024"
        string_val: "../datasets/train-00837-of-01024"
        string_val: "../datasets/train-00836-of-01024"
        string_val: "../datasets/train-00395-of-01024"
        string_val: "../datasets/train-00394-of-01024"
        string_val: "../datasets/train-00161-of-01024"
        string_val: "../datasets/train-00307-of-01024"
        string_val: "../datasets/train-00306-of-01024"
        string_val: "../datasets/train-00160-of-01024"
        string_val: "../datasets/train-00653-of-01024"
        string_val: "../datasets/train-00435-of-01024"
        string_val: "../datasets/train-00434-of-01024"
        string_val: "../datasets/train-00652-of-01024"
        string_val: "../datasets/train-00804-of-01024"
        string_val: "../datasets/train-00494-of-01024"
        string_val: "../datasets/train-00805-of-01024"
        string_val: "../datasets/train-00495-of-01024"
        string_val: "../datasets/train-00768-of-01024"
        string_val: "../datasets/train-00769-of-01024"
        string_val: "../datasets/train-00334-of-01024"
        string_val: "../datasets/train-00152-of-01024"
        string_val: "../datasets/train-00153-of-01024"
        string_val: "../datasets/train-00335-of-01024"
        string_val: "../datasets/train-00406-of-01024"
        string_val: "../datasets/train-00896-of-01024"
        string_val: "../datasets/train-00660-of-01024"
        string_val: "../datasets/train-00661-of-01024"
        string_val: "../datasets/train-00407-of-01024"
        string_val: "../datasets/train-00897-of-01024"
        string_val: "../datasets/train-00189-of-01024"
        string_val: "../datasets/train-00188-of-01024"
        string_val: "../datasets/train-00721-of-01024"
        string_val: "../datasets/train-00547-of-01024"
        string_val: "../datasets/train-00546-of-01024"
        string_val: "../datasets/train-00720-of-01024"
        string_val: "../datasets/train-00013-of-01024"
        string_val: "../datasets/train-00275-of-01024"
        string_val: "../datasets/train-00274-of-01024"
        string_val: "../datasets/train-00012-of-01024"
        string_val: "../datasets/train-00081-of-01024"
        string_val: "../datasets/train-00080-of-01024"
        string_val: "../datasets/train-00629-of-01024"
        string_val: "../datasets/train-00628-of-01024"
        string_val: "../datasets/train-00945-of-01024"
        string_val: "../datasets/train-00944-of-01024"
        string_val: "../datasets/train-00398-of-01024"
        string_val: "../datasets/train-00399-of-01024"
        string_val: "../datasets/train-00530-of-01024"
        string_val: "../datasets/train-00756-of-01024"
        string_val: "../datasets/train-00757-of-01024"
        string_val: "../datasets/train-00531-of-01024"
        string_val: "../datasets/train-00202-of-01024"
        string_val: "../datasets/train-00064-of-01024"
        string_val: "../datasets/train-00065-of-01024"
        string_val: "../datasets/train-00203-of-01024"
        string_val: "../datasets/train-00290-of-01024"
        string_val: "../datasets/train-00291-of-01024"
        string_val: "../datasets/train-00438-of-01024"
        string_val: "../datasets/train-00439-of-01024"
        string_val: "../datasets/train-00932-of-01024"
        string_val: "../datasets/train-00933-of-01024"
        string_val: "../datasets/train-00685-of-01024"
        string_val: "../datasets/train-00873-of-01024"
        string_val: "../datasets/train-00872-of-01024"
        string_val: "../datasets/train-00684-of-01024"
        string_val: "../datasets/train-00579-of-01024"
        string_val: "../datasets/train-00578-of-01024"
        string_val: "../datasets/train-00125-of-01024"
        string_val: "../datasets/train-00343-of-01024"
        string_val: "../datasets/train-00342-of-01024"
        string_val: "../datasets/train-00124-of-01024"
        string_val: "../datasets/train-00617-of-01024"
        string_val: "../datasets/train-00471-of-01024"
        string_val: "../datasets/train-00470-of-01024"
        string_val: "../datasets/train-00616-of-01024"
        string_val: "../datasets/train-01011-of-01024"
        string_val: "../datasets/train-01010-of-01024"
        string_val: "../datasets/train-00111-of-01024"
        string_val: "../datasets/train-00377-of-01024"
        string_val: "../datasets/train-00376-of-01024"
        string_val: "../datasets/train-00110-of-01024"
        string_val: "../datasets/train-00623-of-01024"
        string_val: "../datasets/train-00445-of-01024"
        string_val: "../datasets/train-00444-of-01024"
        string_val: "../datasets/train-00622-of-01024"
        string_val: "../datasets/train-00019-of-01024"
        string_val: "../datasets/train-00018-of-01024"
        string_val: "../datasets/train-00847-of-01024"
        string_val: "../datasets/train-00846-of-01024"
        string_val: "../datasets/train-00183-of-01024"
        string_val: "../datasets/train-00182-of-01024"
        string_val: "../datasets/train-00906-of-01024"
        string_val: "../datasets/train-00596-of-01024"
        string_val: "../datasets/train-00907-of-01024"
        string_val: "../datasets/train-00597-of-01024"
        string_val: "../datasets/train-00158-of-01024"
        string_val: "../datasets/train-00159-of-01024"
        string_val: "../datasets/train-00504-of-01024"
        string_val: "../datasets/train-00994-of-01024"
        string_val: "../datasets/train-00762-of-01024"
        string_val: "../datasets/train-00763-of-01024"
        string_val: "../datasets/train-00505-of-01024"
        string_val: "../datasets/train-00995-of-01024"
        string_val: "../datasets/train-00236-of-01024"
        string_val: "../datasets/train-00050-of-01024"
        string_val: "../datasets/train-00051-of-01024"
        string_val: "../datasets/train-00237-of-01024"
        string_val: "../datasets/train-00787-of-01024"
        string_val: "../datasets/train-00971-of-01024"
        string_val: "../datasets/train-00970-of-01024"
        string_val: "../datasets/train-00786-of-01024"
        string_val: "../datasets/train-00349-of-01024"
        string_val: "../datasets/train-00348-of-01024"
        string_val: "../datasets/train-00715-of-01024"
        string_val: "../datasets/train-00573-of-01024"
        string_val: "../datasets/train-00572-of-01024"
        string_val: "../datasets/train-00714-of-01024"
        string_val: "../datasets/train-00879-of-01024"
        string_val: "../datasets/train-00878-of-01024"
        string_val: "../datasets/train-00027-of-01024"
        string_val: "../datasets/train-00241-of-01024"
        string_val: "../datasets/train-00240-of-01024"
        string_val: "../datasets/train-00026-of-01024"
        string_val: "../datasets/train-00300-of-01024"
        string_val: "../datasets/train-00166-of-01024"
        string_val: "../datasets/train-00167-of-01024"
        string_val: "../datasets/train-00301-of-01024"
        string_val: "../datasets/train-00938-of-01024"
        string_val: "../datasets/train-00939-of-01024"
        string_val: "../datasets/train-00432-of-01024"
        string_val: "../datasets/train-00654-of-01024"
        string_val: "../datasets/train-00655-of-01024"
        string_val: "../datasets/train-00433-of-01024"
        string_val: "../datasets/train-00208-of-01024"
        string_val: "../datasets/train-00209-of-01024"
        string_val: "../datasets/train-00830-of-01024"
        string_val: "../datasets/train-00831-of-01024"
        string_val: "../datasets/train-00392-of-01024"
        string_val: "../datasets/train-00393-of-01024"
        string_val: "../datasets/train-00458-of-01024"
        string_val: "../datasets/train-00459-of-01024"
        string_val: "../datasets/train-00096-of-01024"
        string_val: "../datasets/train-00097-of-01024"
